# Name : Deepak
# Course : MCA
# Roll no: 2301560005

# Import dataset and store it in a variable called (df) and performing some operations

In [25]:
import pandas as pd
df = pd.read_csv("Automobile_data.csv")
df.head(5)

,Unnamed: 0,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [26]:
print(df.head(10))

   Unnamed: 0  index      company   body-style  wheel-base  length  \
0           0      0  alfa-romero  convertible        88.6   168.8
1           1      1  alfa-romero  convertible        88.6   168.8
2           2      2  alfa-romero    hatchback        94.5   171.2
3           3      3         audi        sedan        99.8   176.6
4           4      4         audi        sedan        99.4   176.6
5           5      5         audi        sedan        99.8   177.3
6           6      6         audi        wagon       105.8   192.7
7           7      9          bmw        sedan       101.2   176.8
8           8     10          bmw        sedan       101.2   176.8
9           9     11          bmw        sedan       101.2   176.8

  engine-type num-of-cylinders  horsepower  average-mileage    price
0        dohc             four         111               21  13495.0
1        dohc             four         111               21  16500.0
2        ohcv              six         154               19  16500.0
3         ohc             four         102               24  13950.0
4         ohc             five         115               18  17450.0
5         ohc             five         110               19  15250.0
6         ohc             five         110               19  18920.0
7         ohc             four         101               23  16430.0
8         ohc             four         101               23  16925.0
9         ohc              six         121               21  20970.0

In [27]:
df.shape[0]
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        61 non-null     int64
 1   index             61 non-null     int64
 2   company           61 non-null     object
 3   body-style        61 non-null     object
 4   wheel-base        61 non-null     float64
 5   length            61 non-null     float64
 6   engine-type       61 non-null     object
 7   num-of-cylinders  61 non-null     object
 8   horsepower        61 non-null     int64
 9   average-mileage   61 non-null     int64
 10  price             58 non-null     float64
dtypes: float64(3), int64(4), object(4)
memory usage: 5.4+ KB

In [28]:
df.columns

Index(['Unnamed: 0', 'index', 'company', 'body-style', 'wheel-base', 'length',
       'engine-type', 'num-of-cylinders', 'horsepower', 'average-mileage',
       'price'],
      dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=61, step=1)

In [30]:
car_Manufacturers = df.groupby('company')
toyotaDf = car_Manufacturers.get_group('toyota')
toyotaDf

,Unnamed: 0,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [31]:
car_Manufacturer = df.groupby('company')
price = car_Manufacturer[['company','price']].max()
price

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu   6785.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

In [32]:
car_Manuf = df.groupby('company')
mileageDf = car_Manuf[['company','average-mileage']].mean(numeric_only=True)
mileageDf

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

In [33]:
df.company.dtype

dtype('O')

In [34]:
revenue = (df['index']* df['length']).sum()
print('Revenue was: $' + str(np.round(revenue,2)))

Revenue was: $431810.6

In [35]:
orders = df.company.value_counts().count()
orders

16

# Filtering and sorting exercise

In [36]:
# Step 2. Import the dataset from this address.

# Step 3. Assign it to a variable called game.

In [37]:
game = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/02_Filtering_%26_Sorting/Euro12/Euro_2012_stats_TEAM.csv', sep=',')
game

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20
7,Italy,6,34,45,43.0%,7.5%,110,2,0,0,...,20,74.1%,101,89,16,16,0,18,18,19
8,Netherlands,2,12,36,25.0%,4.1%,60,2,0,0,...,12,70.6%,35,30,3,5,0,7,7,15
9,Poland,2,15,23,39.4%,5.2%,48,0,0,0,...,6,66.7%,48,56,3,7,1,7,7,17
10,Portugal,6,22,42,34.3%,9.3%,82,6,0,0,...,10,71.5%,73,90,10,12,0,14,14,16
11,Republic of Ireland,1,7,12,36.8%,5.2%,28,0,0,0,...,17,65.4%,43,51,11,6,1,10,10,17
12,Russia,5,9,31,22.5%,12.5%,59,2,0,0,...,10,77.0%,34,43,4,6,0,7,7,16
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18
14,Sweden,5,17,19,47.2%,13.8%,39,3,0,0,...,8,61.6%,35,51,7,7,0,9,9,18
15,Ukraine,2,7,26,21.2%,6.0%,38,0,0,0,...,13,76.5%,48,31,4,5,0,9,9,18

In [38]:
#Step 4 Select only the goal coloumn
game.Goals

0      4
1      4
2      4
3      5
4      3
5     10
6      5
7      6
8      2
9      2
10     6
11     1
12     5
13    12
14     5
15     2
Name: Goals, dtype: int64

In [39]:
#Step 5. How many team participated in the Euro2012?
game.shape[0]

16

In [40]:
#Step 6. What is the number of columns in the dataset?
game.info

<bound method DataFrame.info of                    Team  Goals  Shots on target  Shots off target  \
0               Croatia      4               13                12
1        Czech Republic      4               13                18
2               Denmark      4               10                10
3               England      5               11                18
4                France      3               22                24
5               Germany     10               32                32
6                Greece      5                8                18
7                 Italy      6               34                45
8           Netherlands      2               12                36
9                Poland      2               15                23
10             Portugal      6               22                42
11  Republic of Ireland      1                7                12
12               Russia      5                9                31
13                Spain     12               42                33
14               Sweden      5               17                19
15              Ukraine      2                7                26

   Shooting Accuracy % Goals-to-shots  Total shots (inc. Blocked)  \
0              51.9%            16.0%                          32
1              41.9%            12.9%                          39
2              50.0%            20.0%                          27
3              50.0%            17.2%                          40
4              37.9%             6.5%                          65
5              47.8%            15.6%                          80
6              30.7%            19.2%                          32
7              43.0%             7.5%                         110
8              25.0%             4.1%                          60
9              39.4%             5.2%                          48
10             34.3%             9.3%                          82
11             36.8%             5.2%                          28
12             22.5%            12.5%                          59
13             55.9%            16.0%                         100
14             47.2%            13.8%                          39
15             21.2%             6.0%                          38

    Hit Woodwork  Penalty goals  Penalties not scored  ...  Saves made  \
0              0              0                     0  ...          13
1              0              0                     0  ...           9
2              1              0                     0  ...          10
3              0              0                     0  ...          22
4              1              0                     0  ...           6
5              2              1                     0  ...          10
6              1              1                     1  ...          13
7              2              0                     0  ...          20
8              2              0                     0  ...          12
9              0              0                     0  ...           6
10             6              0                     0  ...          10
11             0              0                     0  ...          17
12             2              0                     0  ...          10
13             0              1                     0  ...          15
14             3              0                     0  ...           8
15             0              0                     0  ...          13

    Saves-to-shots ratio  Fouls Won Fouls Conceded  Offsides  Yellow Cards  \
0                  81.3%         41             62         2             9
1                  60.1%         53             73         8             7
2                  66.7%         25             38         8             4
3                  88.1%         43             45         6             5
4                  54.6%         36             51         5             6
5                  62.6%         63             49        12             4
6                  65.1%         67             48        12             9
7                  74.1%        101             89        16            16
8                  70.6%         35             30         3             5
9                  66.7%         48             56         3             7
10                 71.5%         73             90        10            12
11                 65.4%         43             51        11             6
12                 77.0%         34             43         4             6
13                 93.8%        102             83        19            11
14                 61.6%         35             51         7             7
15                 76.5%         48             31         4             5

    Red Cards  Subs on  Subs off  Players Used
0           0        9         9            16
1           0       11        11            19
2           0        7         7            15
3           0       11        11            16
4           0       11        11            19
5           0       15        15            17
6           1       12        12            20
7           0       18        18            19
8           0        7         7            15
9           1        7         7            17
10          0       14        14            16
11          1       10        10            17
12          0        7         7            16
13          0       17        17            18
14          0        9         9            18
15          0        9         9            18

[16 rows x 35 columns]>

In [41]:
#Step 7. View only the columns Team, Yellow Cards and Red Cards and assign them to a dataframe called discipline
disc = game[['Team', 'Yellow Cards', 'Red Cards']]
disc

                   Team  Yellow Cards  Red Cards
0               Croatia             9          0
1        Czech Republic             7          0
2               Denmark             4          0
3               England             5          0
4                France             6          0
5               Germany             4          0
6                Greece             9          1
7                 Italy            16          0
8           Netherlands             5          0
9                Poland             7          1
10             Portugal            12          0
11  Republic of Ireland             6          1
12               Russia             6          0
13                Spain            11          0
14               Sweden             7          0
15              Ukraine             5          0

In [42]:
#Step 8. Sort the teams by Red Cards, then to Yellow Cards
disc.sort_values(['Red Cards', 'Yellow Cards'], ascending = False)

                   Team  Yellow Cards  Red Cards
6                Greece             9          1
9                Poland             7          1
11  Republic of Ireland             6          1
7                 Italy            16          0
10             Portugal            12          0
13                Spain            11          0
0               Croatia             9          0
1        Czech Republic             7          0
14               Sweden             7          0
4                France             6          0
12               Russia             6          0
3               England             5          0
8           Netherlands             5          0
15              Ukraine             5          0
2               Denmark             4          0
5               Germany             4          0

In [43]:
#Step 9. Calculate the mean Yellow Cards given per Team
round(disc['Yellow Cards'].mean())

7

In [44]:
#Step 10. Filter teams that scored more than 6 goals
game[game.Goals > 6]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18

In [45]:
#Step 11. Select the teams that start with G
game[game.Team.str.startswith('G')]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20

In [46]:
#Step 12. Select the first 7 columns
game.iloc[: , 0:7]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked)
0,Croatia,4,13,12,51.9%,16.0%,32
1,Czech Republic,4,13,18,41.9%,12.9%,39
2,Denmark,4,10,10,50.0%,20.0%,27
3,England,5,11,18,50.0%,17.2%,40
4,France,3,22,24,37.9%,6.5%,65
5,Germany,10,32,32,47.8%,15.6%,80
6,Greece,5,8,18,30.7%,19.2%,32
7,Italy,6,34,45,43.0%,7.5%,110
8,Netherlands,2,12,36,25.0%,4.1%,60
9,Poland,2,15,23,39.4%,5.2%,48
10,Portugal,6,22,42,34.3%,9.3%,82
11,Republic of Ireland,1,7,12,36.8%,5.2%,28
12,Russia,5,9,31,22.5%,12.5%,59
13,Spain,12,42,33,55.9%,16.0%,100
14,Sweden,5,17,19,47.2%,13.8%,39
15,Ukraine,2,7,26,21.2%,6.0%,38

In [47]:
#Step 13. Select all columns except the last 3.
game.iloc[: , :-5]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Interceptions,Clearances off line,Clean Sheets,Blocks,Goals conceded,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,56,NaN,0,10,3,13,81.3%,41,62,2
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,37,2.0,1,10,6,9,60.1%,53,73,8
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,59,0.0,1,10,5,10,66.7%,25,38,8
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,72,1.0,2,29,3,22,88.1%,43,45,6
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,58,0.0,1,7,5,6,54.6%,36,51,5
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,69,0.0,1,11,6,10,62.6%,63,49,12
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,87,0.0,1,23,7,13,65.1%,67,48,12
7,Italy,6,34,45,43.0%,7.5%,110,2,0,0,...,136,1.0,2,18,7,20,74.1%,101,89,16
8,Netherlands,2,12,36,25.0%,4.1%,60,2,0,0,...,41,0.0,0,9,5,12,70.6%,35,30,3
9,Poland,2,15,23,39.4%,5.2%,48,0,0,0,...,62,0.0,0,8,3,6,66.7%,48,56,3
10,Portugal,6,22,42,34.3%,9.3%,82,6,0,0,...,86,0.0,2,11,4,10,71.5%,73,90,10
11,Republic of Ireland,1,7,12,36.8%,5.2%,28,0,0,0,...,43,1.0,0,23,9,17,65.4%,43,51,11
12,Russia,5,9,31,22.5%,12.5%,59,2,0,0,...,58,0.0,0,8,3,10,77.0%,34,43,4
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,79,0.0,5,8,1,15,93.8%,102,83,19
14,Sweden,5,17,19,47.2%,13.8%,39,3,0,0,...,45,0.0,1,12,5,8,61.6%,35,51,7
15,Ukraine,2,7,26,21.2%,6.0%,38,0,0,0,...,29,0.0,0,4,4,13,76.5%,48,31,4

In [48]:
#Step 14. Present only the Shooting Accuracy from England, Italy and Russia
game.loc[game.Team.isin(['England', 'Italy', 'Russia']), ['Team','Shooting Accuracy']]

       Team Shooting Accuracy
3   England             50.0%
7     Italy             43.0%
12   Russia             22.5%

# Group by  excercise

In [49]:
#step 1. Import the necessary libraries
#Step 2. Import the dataset.
#Step 3. Assign it to a variable called drnk.
drd = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
drd.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [50]:
#Step 4. Which continent drinks more beer on average?
drd.groupby('continent').beer_servings.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [51]:
#Step 5. For each continent print the statistics for wine consumption.
drd.groupby('continent').wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [52]:
#Step 6. Print the mean alcohol consumption per continent for every column
drd.groupby('continent').spirit_servings.agg(['mean'])

                 mean
continent
AF          16.339623
AS          60.840909
EU         132.555556
OC          58.437500
SA         114.750000

In [53]:
#Step 7. Print the median alcohol consumption per continent for every column
drd.groupby('continent').spirit_servings.agg(['median'])

           median
continent
AF            3.0
AS           16.0
EU          122.0
OC           37.0
SA          108.5

In [54]:
#Step 8. Print the mean, min,max and median values for spirit consumption.
#This time output a DataFrame
drd.groupby('continent').spirit_servings.agg(['mean', 'min', 'max','median'])

                 mean  min  max  median
continent
AF          16.339623    0  152     3.0
AS          60.840909    0  326    16.0
EU         132.555556    0  373   122.0
OC          58.437500    0  254    37.0
SA         114.750000   25  302   108.5

# Apply method

In [55]:
#Step 1. Import the necessary libraries
#Step 2. Import the dataset from this address.
#Step 3. Assign it to a variable called df.
csv_url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv'
df = pd.read_csv(csv_url)
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

In [56]:
#Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column
stud_al = df.loc[: , "school":"guardian"]
stud_al.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father

In [57]:
#Step 5. Create a lambda function that will capitalize strings.
capitalizer = lambda x: x.capitalize()

In [58]:
#Step 6. Capitalize both Mjob and Fjob
stud_al['Mjob'].apply(capitalizer)
stud_al['Fjob'].apply(capitalizer)

0       Teacher
1         Other
2         Other
3      Services
4         Other
         ...
390    Services
391    Services
392       Other
393       Other
394     At_home
Name: Fjob, Length: 395, dtype: object

In [59]:
#Step 7. Print the last elements of the data set.
stud_al.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,services,services,course,other
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother
392,MS,M,21,R,GT3,T,1,1,other,other,course,other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father

In [60]:
#Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and capitalize Mjob and Fjob.
stud_al['Mjob'] = stud_al['Mjob'].apply(capitalizer)
stud_al['Fjob'] = stud_al['Fjob'].apply(capitalizer)
stud_al.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,Services,Services,course,other
391,MS,M,17,U,LE3,T,3,1,Services,Services,course,mother
392,MS,M,21,R,GT3,T,1,1,Other,Other,course,other
393,MS,M,18,R,LE3,T,3,2,Services,Other,course,mother
394,MS,M,19,U,LE3,T,1,1,Other,At_home,course,father

In [61]:
#Step 9. Create a function called majority that returns a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)
def majority(x):
    if x > 17:
        return True
    else:
        return False

In [62]:
stud_al['legal_drinker'] = stud_al['age'].apply(majority)
stud_al.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,18,U,GT3,A,4,4,At_home,Teacher,course,mother,True
1,GP,F,17,U,GT3,T,1,1,At_home,Other,course,father,False
2,GP,F,15,U,LE3,T,1,1,At_home,Other,other,mother,False
3,GP,F,15,U,GT3,T,4,2,Health,Services,home,mother,False
4,GP,F,16,U,GT3,T,3,3,Other,Other,home,father,False

In [63]:
#Step 10. Multiply every number of the dataset by 10.
#I know this makes no sense, don't forget it is just an exercise
def times10(x):
    if type(x) is int:
        return 10 * x
    return x
stud_al.applymap(times10).head(10)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,180,U,GT3,A,40,40,At_home,Teacher,course,mother,True
1,GP,F,170,U,GT3,T,10,10,At_home,Other,course,father,False
2,GP,F,150,U,LE3,T,10,10,At_home,Other,other,mother,False
3,GP,F,150,U,GT3,T,40,20,Health,Services,home,mother,False
4,GP,F,160,U,GT3,T,30,30,Other,Other,home,father,False
5,GP,M,160,U,LE3,T,40,30,Services,Other,reputation,mother,False
6,GP,M,160,U,LE3,T,20,20,Other,Other,home,mother,False
7,GP,F,170,U,GT3,A,40,40,Other,Teacher,home,mother,False
8,GP,M,150,U,LE3,A,30,20,Services,Other,home,mother,False
9,GP,M,150,U,GT3,T,30,40,Other,Other,home,mother,False

# Merge

In [64]:
#Step 1. Import the necessary libraries
#Step 2. Import the first dataset car1 and car2.
#Step 3. Assign each to a to a variable called car1 and car2
car1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
car2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

print(car1.head())
print(car2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

In [65]:
#Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1
car1 = car1.loc[:, "mpg":"car"]
print(type(car1))
car1.head()

<class 'pandas.core.frame.DataFrame'>

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

In [66]:
#Step 5. What is the number of observations in each dataset?
print(car1.shape)
print(car2.shape)

(198, 9)
(200, 9)

In [67]:
#Step 6. Join car1 and car2 into a single DataFrame called cars
cars = pd.concat([car1,car2])
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

In [68]:
nr_ownr = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_ownr

array([36379, 57512, 34349, 19207, 54118, 70836, 41090, 71632, 49642,
       55429, 34741, 65296, 59541, 52196, 51933, 19871, 36869, 33330,
       68783, 16864, 58363, 18158, 42230, 67901, 64616, 39365, 37987,
       58219, 62124, 55549, 44064, 40062, 70721, 30398, 63850, 44619,
       19675, 41310, 61655, 72530, 17376, 72009, 51104, 66630, 51390,
       45577, 19964, 32885, 20025, 20135, 63102, 17579, 59782, 23385,
       31793, 55658, 52203, 71134, 32740, 71290, 38017, 54971, 72335,
       42182, 23743, 67256, 28205, 69309, 34354, 17958, 60673, 68020,
       61865, 43765, 48325, 32689, 40737, 34971, 22518, 21950, 57688,
       36258, 22236, 25556, 64242, 42452, 40765, 35129, 63191, 56821,
       24826, 54075, 19294, 47028, 18328, 38890, 58884, 16295, 49446,
       69839, 55008, 36631, 31759, 25499, 16232, 63802, 69001, 67542,
       70494, 51782, 54635, 28487, 39878, 19984, 32273, 72354, 72154,
       37065, 48536, 55842, 49311, 19550, 52017, 49117, 32080, 27228,
       63678, 44120, 33132, 15932, 41844, 26740, 18159, 72926, 41155,
       60299, 25156, 72535, 53918, 67806, 57752, 50943, 21928, 63925,
       29726, 39356, 48489, 65327, 30107, 55181, 51889, 56059, 65940,
       53672, 17183, 53644, 35607, 48585, 18312, 18150, 34089, 29869,
       33930, 22469, 65776, 24571, 42659, 58952, 23976, 65570, 55829,
       51897, 37628, 49549, 26356, 72695, 69454, 31982, 29294, 32959,
       24810, 28706, 67166, 27225, 50201, 64428, 22573, 24041, 15550,
       57966, 19384, 47076, 56314, 59729, 22026, 54544, 34862, 44417,
       67200, 32440, 67215, 50774, 52279, 57604, 72307, 45752, 56692,
       66331, 52718, 24632, 20401, 63405, 33099, 66438, 34867, 38622,
       47293, 58518, 55947, 63862, 44233, 64913, 24194, 59194, 23447,
       61006, 16728, 56199, 18904, 60358, 59183, 66517, 42002, 31979,
       50383, 23553, 18547, 69017, 70114, 54017, 38082, 38807, 49255,
       39299, 21467, 45960, 16524, 63862, 64402, 36280, 56454, 34948,
       43058, 71825, 56858, 49871, 70530, 46264, 37816, 36347, 38825,
       65955, 72078, 46475, 52161, 19841, 70781, 71339, 67621, 23211,
       65987, 40838, 40141, 53356, 68792, 45580, 65903, 67783, 25250,
       41111, 20480, 26713, 40593, 20839, 56491, 45115, 30818, 62449,
       68677, 55362, 63056, 59797, 30668, 45663, 40718, 32147, 43666,
       27483, 27604, 37663, 64590, 52013, 23318, 59768, 27770, 27420,
       64223, 43083, 65841, 29072, 18603, 64497, 15560, 69333, 70116,
       55555, 51095, 30678, 19421, 57774, 21622, 49586, 20408, 18306,
       17007, 35314, 60444, 69805, 35409, 34581, 50892, 21145, 25019,
       29039, 64907, 55767, 70691, 23055, 59521, 54062, 33012, 20737,
       24777, 16146, 64551, 48154, 30510, 27788, 15666, 46468, 37727,
       41246, 72143, 28089, 18695, 25100, 15471, 19308, 58797, 19819,
       69991, 47759, 48573, 17155, 67156, 63076, 30388, 40983, 42903,
       36869, 49370, 64913, 40825, 56256, 16806, 55362, 64929, 39276,
       58317, 51222, 58796, 53045, 31146, 15390, 67040, 33812, 19910,
       18020, 70078, 36174, 54375, 44217, 28844, 37952, 70429, 19462,
       40269, 33157])

In [69]:
cars['owners'] = nr_ownr
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,37952
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,70429
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,19462
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,40269
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,33157

# Data Vizualization

In [70]:
# Step 1. Import the necessary libraries
import matplotlib.pyplot as plt
import seaborn as sns

# set the graphs to show in the jupyter notebook
%matplotlib inline

# set seaborn graphs to a better style
sns.set(style="ticks")

In [71]:
#Step 2. Import the dataset from this address.
#Step 3. Assign it to a variable called online_rt
#Note: if you receive a utf-8 decode error, set encoding = 'latin1' in pd.read_csv().

path = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/07_Visualization/Online_Retail/Online_Retail.csv'

onl_rt = pd.read_csv(path, encoding = 'latin1')

onl_rt.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom

In [ ]:
#Step 4. Create a histogram with the 10 countries that have the most 'Quantity' ordered except UK
# group by the Country
countries = onl_rt.groupby('Country').sum()

# sort the value and get the first 10 after UK
countries = countries.sort_values(by = 'Quantity',ascending = False)[1:11]

# create the plot
countries['Quantity'].plot(kind='bar')

# Set the title and labels
plt.xlabel('Countries')
plt.ylabel('Quantity')
plt.title('10 Countries with most orders')

# show the plot
plt.show()

In [ ]:
onl_rt = onl_rt[onl_rt.Quantity > 0]
onl_rt.head()